angular.module('starter.services', [])



//获奖展示
    .factory('Trophy', function () {
        var trophy = [{
            id: 1,
            img1: './img/face1.jpg',
            img2: './img/face1.jpg',
            img3: './img/face1.jpg',
            time:'2011年1月10日',
            name:'张三锋，胡敏，王鑫，邓萍',
            text: '广东四校联盟冠军杯',
            text1: '广东四校联盟冠军杯是2011年1月10日张三锋，胡敏，王鑫等同学参与广东一中，二中，紫荆中学，五中等四校联合举办的青少年IT技术创新大赛，并在比赛中获得优异的成绩，特发此奖杯，以表奖励。'
        },
            {
                id: 2,
                img1: './img/face1.jpg',
                img2: './img/face1.jpg',
                img3: './img/face1.jpg',
                time:'2011年8月10日',
                name:'欧彬，潘琦，梁伟',
                text: '广东前三甲获奖',
                text1: '奖杯是对那些在某一领域中有杰出表现的人物和单位所提供的一种奖励物品，特别是在大规模的巡回体育竞技活动中所常见，体育选手通过公平的竞赛活动来赢取胜利，胜利者会得到主办者给予某些物品作为奖励。'
            },
            {
                id: 3,
                img1: './img/face2.jpg',
                img2: './img/face2.jpg',
                img3: './img/face2.jpg',
                time:'2011年6月10日',
                name:'张三锋，胡敏，刘奇',
                text: '少年儿童全国大赛冠军',
                text1: '奖杯是对那些在某一领域中有杰出表现的人物和单位所提供的一种奖励物品，特别是在大规模的巡回体育竞技活动中所常见，体育选手通过公平的竞赛活动来赢取胜利，胜利者会得到主办者给予某些物品作为奖励。'
            },
            {
                id: 4,
                img1: './img/face2.jpg',
                img2: './img/face2.jpg',
                img3: './img/face2.jpg',
                time:'2011年15月20日',
                name:'程成，林兴，黎健',
                text: '珠海市冠军杯',
                text1: '奖杯是对那些在某一领域中有杰出表现的人物和单位所提供的一种奖励物品，特别是在大规模的巡回体育竞技活动中所常见，体育选手通过公平的竞赛活动来赢取胜利，胜利者会得到主办者给予某些物品作为奖励。'
            },
            {
                id: 5,
                img1: './img/face2.jpg',
                img2: './img/face2.jpg',
                img3: './img/face2.jpg',
                time:'2012年1月120日',
                name:'王章，胡敏，张琳',
                text: '青少年全国大赛冠军',
                text1: '奖杯是对那些在某一领域中有杰出表现的人物和单位所提供的一种奖励物品，特别是在大规模的巡回体育竞技活动中所常见，体育选手通过公平的竞赛活动来赢取胜利，胜利者会得到主办者给予某些物品作为奖励。'
            }];
        return {
            all: function () {
                return trophy;
            },
            get: function (trophyId) {
                for (var i = 0; i < trophy.length; i++) {
                    if (trophy[i].id === parseInt(trophyId)) {
                        return trophy[i];
                    }
                }
                return null;
            }

        };
    })
//招聘信息
    .factory('Messages', function () {
        var messages = [{
            id: 0,
            name: '兵乓球',
            time: '1年',
            diplomas: '专科',
            price:'3000－5000',
            ask: '1、具有中华人民共和国国籍，享有公民政治权利。2、具有良好的品德和职业道德，愿意履行雇员职责与义务。3、具有拟聘用岗位要求的工作能力;4、符合拟聘用岗位要求的身体条件;',
            phone:'13158746812'
        },
            {
                id: 1,
                name: '英语',
                time: '1年',
                diplomas: '专科',
                price:'面议',
                ask: '1、具有中华人民共和国国籍，享有公民政治权利。2、具有良好的品德和职业道德，愿意履行雇员职责与义务。3、具有拟聘用岗位要求的工作能力;4、符合拟聘用岗位要求的身体条件;',
                phone:'13158746812'
            },
            {
                id: 2,
                name: '游泳教练',
                time: '3年',
                diplomas: '本科',
                price:'面议',
                ask: '1、具有中华人民共和国国籍，享有公民政治权利。2、具有良好的品德和职业道德，愿意履行雇员职责与义务。3、具有拟聘用岗位要求的工作能力;4、符合拟聘用岗位要求的身体条件;',
                phone:'13158746812'
            },
            {
                id: 3,
                name: '小学数学老师',
                time: '1年',
                diplomas: '专科',
                price:'2000+4000',
                ask: '1、具有中华人民共和国国籍，享有公民政治权利。2、具有良好的品德和职业道德，愿意履行雇员职责与义务。3、具有拟聘用岗位要求的工作能力;4、符合拟聘用岗位要求的身体条件;',
                phone:'13158746812'
            },
            {
                id: 4,
                name: '礼仪老师',
                time: '2年',
                diplomas: '博士',
                price:'面议',
                ask: '1、具有中华人民共和国国籍，享有公民政治权利。2、具有良好的品德和职业道德，愿意履行雇员职责与义务。3、具有拟聘用岗位要求的工作能力;4、符合拟聘用岗位要求的身体条件;',
                phone:'13158746812'
            }];
        return {
            all: function () {
                return messages;
            },
            get: function (messageId) {
                for (var i = 0; i < messages.length; i++) {
                    if (messages[i].id === parseInt(messageId)) {
                        return messages[i];
                    }
                }
                return null;
            }
        };
    })




// 第一个课程的数据（语言类）
    .factory('Train1', function () {
        // Might use a resource here that returns a JSON array
        var train1 = [{
            id: 0,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '09/19~09/28 ',
            date3: '10/19~10/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '英语',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#c5bee8'
        }, {
            id: 1,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '09/19~09/28 ',
            date3: '10/19~10/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '法语',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#e8c4ea'
        }, {
            id: 2,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '09/19~09/28 ',
            date3: '10/19~10/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '粤语',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#d1ef90'
        }, {
            id: 3,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '09/19~09/28 ',
            date3: '10/19~10/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '俄语',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#97ecef'
        }];
        return {
            all: function () {
                return train1;
            },
            get: function (trainId) {
                for (var i = 0; i < train1.length; i++) {
                    if (train1[i].id === parseInt(trainId)) {
                        return train1[i];
                    }
                }
                return null;
            }
        };
    })
// 第二个课程的数据（学习类）
    .factory('Train2', function () {

        var train2 = [{
            id: 0,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '数学',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#97ecef'

        }, {
            id: 1,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '语文',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#c5bee8'
        }, {
            id: 2,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '美术',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#e8c4ea'
        }, {
            id: 3,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '硬笔字',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560起',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#d1ef90'
        }];
        return {
            all: function () {
                return train2;
            },
            get: function (trainId) {
                for (var i = 0; i < train2.length; i++) {
                    if (train2[i].id === parseInt(trainId)) {
                        return train2[i];
                    }
                }
                return null;
            }
        };
    })
// 第三个课程的数据（舞蹈类）
    .factory('Train3', function () {
        var train3 = [{
            id: 0,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30 ／下午15:30-16:50',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '芭蕾舞',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#d1ef90'
        }, {
            id: 1,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '恰恰',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#97ecef'
        }, {
            id: 2,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '爵士',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#c5bee8'
        }, {
            id: 3,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: 'hip-hop',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#e8c4ea'
        }];
        return {
            all: function () {
                return train3;
            },
            get: function (trainId) {
                for (var i = 0; i < train3.length; i++) {
                    if (train3[i].id === parseInt(trainId)) {
                        return train3[i];
                    }
                }
                return null;
            }
        };
    })
// 第四个课程的数据（音乐类）
    .factory('Train4', function () {
        var train4 = [{
            id: 0,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '钢琴',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#e8c4ea'
        }, {
            id: 1,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '吉他',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#d1ef90'
        }, {
            id: 2,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '古筝',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#97ecef'
        }, {
            id: 3,
            keci: '10',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '口琴',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#c5bee8'
        }];
        return {
            all: function () {
                return train4;
            },
            get: function (trainId) {
                for (var i = 0; i < train4.length; i++) {
                    if (train4[i].id === parseInt(trainId)) {
                        return train4[i];
                    }
                }
                return null;
            }
        };
    })
//已报课程
    .factory('Lessonens', function () {
        var lessonens = [{
            id: 0,
            keci: '10',
            state:'处理中',
            student:'黄狗蛋',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '优惠课堂英语',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#e8c4ea'
        }, {
            id: 1,
            keci: '10',
            state:'已上3节',
            student:'爱上我',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '优惠课堂语文',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#d1ef90'
        }, {
            id: 2,
            keci: '10',
            state:'已上5节',
            student:'你怕吗',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '优惠课堂数学',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#97ecef'
        }, {
            id: 3,
            keci: '10',
            state:'已上6节',
            student:'小奇葩',
            date: '08/19~08/28 ',
            date2: '08/19~08/28 ',
            date3: '08/19~08/28 ',
            time:'每天8:30-11:30',
            place: '红旗镇XX教育结构二楼408课室',
            time1: '2015/08/18日前',
            text: '这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介这里师课堂简介',
            name: '优惠课堂礼仪',
            age: '4到8岁',
            target: '这里是教学目标 这里是教学目标这里是教学目标这里是教学目标 这里是教学目标  这里是教学目标这里是教学目标这里是教学目标',
            content: '这里是授课内容 这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容这里是授课内容',
            price: '560元',
            Text: '听说速成课程紧贴生活，通过新东方顶级名师的讲解，为你营造出真实的国外生活场景，帮你轻松理解并记忆每一句话。多到目不暇接的话题，全到不能再全的会话，想学不好英语口语都难！全到不能再全的口语课程，走到哪用到哪的地道英文！全！各大主题，上百个细分的话题，涵盖日常生活的各个方面！酷！传统课堂上学不到的美式英语，一种意思多种表达，你总比别人多会几句！值！标准美音，超全语汇，经典句型，地道表达，听力技巧，文化链接给你超值的学习体验！中外教亲情教授，全面结合引进的原版剑桥大学出版社权威口语教材，进一步实战练习，真正帮助学员克服开口障碍，帮助学员在特定的场合、以正确的表达方式、地道惯用的英语口语和外国人进行有效沟通。',
            teacher: 'bbo',
            face: 'img/preschool.jpg',
            color: '#c5bee8'
        }];
        return {
            all: function () {
                return lessonens;
            },
            get: function (lessonensId) {
                for (var i = 0; i < lessonens.length; i++) {
                    if (lessonens[i].id === parseInt(lessonensId)) {
                        return lessonens[i];
                    }
                }
                return null;
            }
        };
    })

//课程按预约报名跳转
    .factory('User', function() {

        var o = {
            myfavorites:[]
        }
        o.addFruitToFavorites = function(train) {

            o.myfavorites.unshift(train);
        }

        o.remove=function(train){
            o.myfavorites.splice(o.myfavorites.indexOf(train),1);
        }
        return o;

    })
    //留言跳转
    .factory('Message', function() {

        var o = {
            mymessage:[]
        }
        o.addFruitToFavorites = function(text) {

            o.mymessage.unshift(text);
        }

        o.remove=function(text){
            o.mymessage.splice(o.mymessage.indexOf(text),1);
        }
        return o;

    })
//全体教师
    .factory('Teacherss', function () {
        var teacher = [{
            id: 0,
            name: '吴一生',
            sex: '男',
            age: '34',
            class: '小学数学',
            face1: './img/t1.jpg',
            face2: './img/t2.jpg',
            face3: './img/t3.jpg',
            say: '不管多么严峻的形势向你逼来，你也要努力去发现有利的条件。',
            school: '广科',
            major: '计算机',
            time: '3'

        }, {
            id: 1,
            name: '吴三声',
            sex: '男',
            age: '32',
            class: '吉他 尤克里里 小提琴',
            face1: './img/t1.jpg',
            face2: './img/t2.jpg',
            face3: './img/t3.jpg',
            say: '人生之路，不会笔直向前的，总有崎岖泥泞，总有坎坷艰辛.',
            school: '广科',
            major: '计算机',
            time: '3'
        }, {
            id: 2,
            name: '吴四省',
            class: '尤克里里 古筝',
            sex: '男',
            age: '34',
            face1: './img/t1.jpg',
            face2: './img/t2.jpg',
            face3: './img/t3.jpg',
            say: '不是你努力了就一定能成功，但更不是你不努力就能成功的，你家里的父母，你未来的家庭，都得靠着你呢，你就坐着泄气啊?',
            school: '广科',
            major: '计算机',
            time: '3'
        }, {
            id: 3,
            name: '吴二大',
            class: '球类',
            sex: '男',
            age: '34',
            face1: './img/t1.jpg',
            face2: './img/t2.jpg',
            face3: './img/t3.jpg',
            say: '伟人所到达并持续着的高处，并不是一飞就到的，而是他们在同伴们都睡着的时候，一步步艰辛地向上攀爬的。',
            school: '广科',
            major: '计算机',
            time: '3'
        }, {
            id: 4,
            name: '吴五狗',
            class: '游泳 健身',
            sex: '男',
            age: '34',
            face1: './img/t1.jpg',
            face2: './img/t2.jpg',
            face3: './img/t3.jpg',
            say: '背向阳光，阴影过后，还是光明。',
            school: '广科',
            major: '计算机',
            time: '3'
        }];

        return {
            all: function () {
                return teacher;
            },
            remove: function (chat) {
                teacher.splice(teacher.indexOf(chat), 1);
            },
            get: function (teacherId) {
                for (var i = 0; i < teacher.length; i++) {
                    if (teacher[i].id === parseInt(teacherId)) {
                        return teacher[i];
                    }
                }
                return null;
            }
        };
    })
    .factory('Activity',function(){
        var activity = [{
           id:0,
            activity:'五一节大回馈',
            teacher:'bobi',
            name:'英语',
            price:'500（560）元',
            time:'5/10～6/10'
        },{
            id:1,
            activity:'五一节大回馈',
            teacher:'bobi',
            name:'英语',
            price:'400（580）元',
           time:'5/10～6/10'
        },{
            id:2,
            activity:'五一节大回馈',
            teacher:'bobi',
            name:'英语',
            price:'460（600）元',
           time:'5/10～6/10'
        },{
            id: 3,
            activity:'五一节大回馈',
            teacher:'bobi',
            name:'英语',
            price:'460（500）元',
            time:'5/10～6/10'
        }, {
            id: 4,
            activity:'五一节大回馈',
            teacher:'bobi',
            name:'英语',
            price:'300（450）元',
            time:'5/10～6/10'
        }, {
            id: 5,
            activity:'五一节大回馈',
            teacher:'bobi',
            name:'英语',
            price:'350（451）元',
            time:'5/10～6/10'
        }]
        return{
            all:function(){
                return activity;
            },
            get:function(activityId){
                for(var i=0;i<activity.length;i++){
                    if(activity[i].id===parseInt(activityId)){
                        return activity[i];
                    }
                }
                return null;
            }
        }
    })
    .factory('Newmessage',function(){
        var activity = [

        ]

        return{
            all:function(){
                return activity;
            },
            get:function(activityId){
                for(var i=0;i<activity.length;i++){
                    if(activity[i].id===parseInt(activityId)){
                        return activity[i];
                    }
                }
                return null;
            }
        }
    })
//动态主页面
    .factory('Trend1',function() {
        var trend1 = [{
            face: './img/dog1.jpg',
            name: 'Braie',
            content: './img/ionic.png',
            video: './img/11.mp4',
            time: '15分钟前'
        },{
            face: './img/dog1.jpg',
            name: 'Braie',
            content: './img/ionic.png',
            video: './img/11.mp4',
            time: '15分钟前'
        },{
            face: './img/dog1.jpg',
            name: 'Braie',
            content: './img/ionic.png',
            video: './img/11.mp4',
            time: '15分钟前'
        }]
        return {
            all: function () {
                return trend1;
            }
        }
    })
